# **Create or Connect DataBase**

In [ ]:
import sqlite3
SqlConnection = sqlite3.connect('sql.db')

# To execute query Cursor method is used

In [ ]:
cursorrr = SqlConnection.cursor()

# **Write a Query & Execute it With Cursor**

In [ ]:
query = 'select sqlite_version();'
cursorrr.execute(query)

In [ ]:
#Fetch and Output Result

result = cursorrr.fetchall()
print('SQLite Version is {}'.format(result))


cursorrr.close()

SQLite Version is [('3.37.2',)]

In [ ]:
try:

  SqlConnection = sqlite3.connect('sql.db')
  cursorrr = SqlConnection.cursor()
  print('DB INIT')

  query = 'select sqlite_version();'
  cursorrr.execute(query)


  result = cursorrr.fetchall()
  print('SQLite Version is {}'.format(result))


  cursorrr.close()


#Handle Errors
except sqlite3.Error as error:
  print('Error Occured - ',error)


finally:
  if SqlConnection:
    SqlConnection.close()
    print('SQLITE CONNECTION CLOSED')

DB INIT
SQLite Version is [('3.37.2',)]
SQLITE CONNECTION CLOSED

# **Create a Table and Add 10 records**

In [ ]:
import sqlite3
connection = sqlite3.connect("EmpDetails")
connection.execute('''CREATE TABLE IF NOT EXISTS Emp
(EmpId INT PRIMARY KEY NOT NULL,
EmpName TEXT NOT NULL,
EmpDept TEXT NOT NULL,
EmpAge INT NOT NULL,
EmpSalary INT NOT NULL)
''')
connection.execute("INSERT INTO Emp VALUES (201,'Ujjawal','DS',21,90000)")
connection.execute("INSERT INTO Emp VALUES (202,'Satya','AIML',22,80000)")
connection.execute("INSERT INTO Emp VALUES (203,'Raj','IOT',23,70000)")
connection.execute("INSERT INTO Emp VALUES (204,'Arnav','MCA',24,60000)")
connection.execute("INSERT INTO Emp VALUES (205,'Arman','MBA',25,50000)")
connection.execute("INSERT INTO Emp VALUES (206,'Arjun','AI',26,40000)")
connection.execute("INSERT INTO Emp VALUES (207,'Deepak','MTECH',27,30000)")
# Additional entries
connection.execute("INSERT INTO Emp VALUES (208,'John','DS',28,80000)")
connection.execute("INSERT INTO Emp VALUES (209,'Jane','AIML',29,70000)")
connection.execute("INSERT INTO Emp VALUES (210,'Doe','IOT',30,60000)")
connection.execute("INSERT INTO Emp VALUES (211,'Smith','MCA',31,50000)")
connection.execute("INSERT INTO Emp VALUES (212,'Brown','MBA',32,40000)")
connection.execute("INSERT INTO Emp VALUES (213,'Taylor','AI',33,30000)")
connection.execute("INSERT INTO Emp VALUES (214,'Johnson','MTECH',34,20000)")
connection.execute("INSERT INTO Emp VALUES (215,'Williams','DS',35,10000)")

# Fetch all rows from the table
cursor = connection.cursor()
rows = cursor.execute("SELECT * FROM Emp").fetchall()

# Print all rows
for row in rows:
    print(row)

(201, 'Ujjawal', 'DS', 21, 90000)
(202, 'Satya', 'AIML', 22, 80000)
(203, 'Raj', 'IOT', 23, 70000)
(204, 'Arnav', 'MCA', 24, 60000)
(205, 'Arman', 'MBA', 25, 50000)
(206, 'Arjun', 'AI', 26, 40000)
(207, 'Deepak', 'MTECH', 27, 30000)
(208, 'John', 'DS', 28, 80000)
(209, 'Jane', 'AIML', 29, 70000)
(210, 'Doe', 'IOT', 30, 60000)
(211, 'Smith', 'MCA', 31, 50000)
(212, 'Brown', 'MBA', 32, 40000)
(213, 'Taylor', 'AI', 33, 30000)
(214, 'Johnson', 'MTECH', 34, 20000)
(215, 'Williams', 'DS', 35, 10000)

In [ ]:
rows = cursor.execute("SELECT EmpName, EmpAge FROM Emp").fetchall()

# Print 'EmpName' and 'EmpAge'
for row in rows:
    print(row)

('Ujjawal', 21)
('Satya', 22)
('Raj', 23)
('Arnav', 24)
('Arman', 25)
('Arjun', 26)
('Deepak', 27)
('John', 28)
('Jane', 29)
('Doe', 30)
('Smith', 31)
('Brown', 32)
('Taylor', 33)
('Johnson', 34)
('Williams', 35)

In [ ]:
# Fetch 'EmpName' and 'EmpAge' attributes from rows where 'EmpSalary' is greater than 50000
rows = cursor.execute("SELECT EmpName, EmpAge FROM Emp WHERE EmpSalary > 50000").fetchall()

# Print 'EmpName' and 'EmpAge'
for row in rows:
    print(row)

('Ujjawal', 21)
('Satya', 22)
('Raj', 23)
('Arnav', 24)
('John', 28)
('Jane', 29)
('Doe', 30)

In [ ]:
# Fetch 'EmpName' and 'EmpAge' attributes from rows where 'EmpSalary' is greater than 50000 and 'EmpAge' is less than 30
rows = cursor.execute("SELECT EmpName, EmpAge FROM Emp WHERE EmpSalary > 50000 AND EmpAge < 30").fetchall()

# Print 'EmpName' and 'EmpAge'
for row in rows:
    print(row)

('Ujjawal', 21)
('Satya', 22)
('Raj', 23)
('Arnav', 24)
('John', 28)
('Jane', 29)

In [ ]:
# Fetch all records from the table and order them by 'EmpSalary' in descending order
rows = cursor.execute("SELECT * FROM Emp ORDER BY EmpSalary DESC").fetchall()

# Print all records
for row in rows:
    print(row)

(201, 'Ujjawal', 'DS', 21, 90000)
(202, 'Satya', 'AIML', 22, 80000)
(208, 'John', 'DS', 28, 80000)
(203, 'Raj', 'IOT', 23, 70000)
(209, 'Jane', 'AIML', 29, 70000)
(204, 'Arnav', 'MCA', 24, 60000)
(210, 'Doe', 'IOT', 30, 60000)
(205, 'Arman', 'MBA', 25, 50000)
(211, 'Smith', 'MCA', 31, 50000)
(206, 'Arjun', 'AI', 26, 40000)
(212, 'Brown', 'MBA', 32, 40000)
(207, 'Deepak', 'MTECH', 27, 30000)
(213, 'Taylor', 'AI', 33, 30000)
(214, 'Johnson', 'MTECH', 34, 20000)
(215, 'Williams', 'DS', 35, 10000)

In [ ]:
# Fetch top 4 records from the table
rows = cursor.execute("SELECT * FROM Emp ORDER BY EmpSalary DESC LIMIT 4").fetchall()

# Print the records
for row in rows:
    print(row)

(201, 'Ujjawal', 'DS', 21, 90000)
(202, 'Satya', 'AIML', 22, 80000)
(208, 'John', 'DS', 28, 80000)
(203, 'Raj', 'IOT', 23, 70000)

In [ ]:

# Fetch records where 'EmpDept' is 'DS'
rows = cursor.execute("SELECT * FROM Emp WHERE EmpDept = 'DS'").fetchall()

# Print the records before update
print("Before update:")
for row in rows:
    print(row)

# Update 'EmpSalary' for all records where 'EmpDept' is 'DS'
cursor.execute("UPDATE Emp SET EmpSalary = 2500000 WHERE EmpDept = 'DS'")

# Fetch records where 'EmpDept' is 'DS'
rows = cursor.execute("SELECT * FROM Emp WHERE EmpDept = 'DS'").fetchall()

# Print the records after update
print("After update:")
for row in rows:
    print(row)

Before update:
(201, 'Ujjawal', 'DS', 21, 90000)
(208, 'John', 'DS', 28, 80000)
(215, 'Williams', 'DS', 35, 10000)
After update:
(201, 'Ujjawal', 'DS', 21, 2500000)
(208, 'John', 'DS', 28, 2500000)
(215, 'Williams', 'DS', 35, 2500000)

In [ ]:
# Fetch records where 'EmpDept' is 'IOT'
rows = cursor.execute("SELECT * FROM Emp WHERE EmpDept = 'IOT'").fetchall()

# Print the records before deletion
print("Before deletion:")
for row in rows:
    print(row)

# Delete records where 'EmpDept' is 'IOT'
cursor.execute("DELETE FROM Emp WHERE EmpDept = 'IOT'")

# Fetch all records from the table
rows = cursor.execute("SELECT * FROM Emp").fetchall()

# Print the records after deletion
print("After deletion:")
for row in rows:
    print(row)

Before deletion:
After deletion:
(201, 'Ujjawal', 'DS', 21, 2500000)
(202, 'Satya', 'AIML', 22, 80000)
(204, 'Arnav', 'MCA', 24, 60000)
(205, 'Arman', 'MBA', 25, 50000)
(206, 'Arjun', 'AI', 26, 40000)
(207, 'Deepak', 'MTECH', 27, 30000)
(208, 'John', 'DS', 28, 2500000)
(209, 'Jane', 'AIML', 29, 70000)
(211, 'Smith', 'MCA', 31, 50000)
(212, 'Brown', 'MBA', 32, 40000)
(213, 'Taylor', 'AI', 33, 30000)
(214, 'Johnson', 'MTECH', 34, 20000)
(215, 'Williams', 'DS', 35, 2500000)

In [ ]:
# Fetch all records from the table
rows = cursor.execute("SELECT * FROM Emp").fetchall()

# Print the records before fetching
print("Before fetching:")
for row in rows:
    print(row)

# Fetch min, max, avg, sum of 'EmpSalary'
min_salary = cursor.execute("SELECT MIN(EmpSalary) FROM Emp").fetchone()[0]
max_salary = cursor.execute("SELECT MAX(EmpSalary) FROM Emp").fetchone()[0]
avg_salary = cursor.execute("SELECT AVG(EmpSalary) FROM Emp").fetchone()[0]
sum_salary = cursor.execute("SELECT SUM(EmpSalary) FROM Emp").fetchone()[0]

# Print min, max, avg, sum of 'EmpSalary'
print("\nMin Salary: ", min_salary)
print("Max Salary: ", max_salary)
print("Average Salary: ", avg_salary)
print("Sum of Salaries: ", sum_salary)

Before fetching:
(201, 'Ujjawal', 'DS', 21, 2500000)
(202, 'Satya', 'AIML', 22, 80000)
(204, 'Arnav', 'MCA', 24, 60000)
(205, 'Arman', 'MBA', 25, 50000)
(206, 'Arjun', 'AI', 26, 40000)
(207, 'Deepak', 'MTECH', 27, 30000)
(208, 'John', 'DS', 28, 2500000)
(209, 'Jane', 'AIML', 29, 70000)
(211, 'Smith', 'MCA', 31, 50000)
(212, 'Brown', 'MBA', 32, 40000)
(213, 'Taylor', 'AI', 33, 30000)
(214, 'Johnson', 'MTECH', 34, 20000)
(215, 'Williams', 'DS', 35, 2500000)

Min Salary:  20000
Max Salary:  2500000
Average Salary:  613076.9230769231
Sum of Salaries:  7970000

In [ ]:
# Fetch 'EmpName' column from the table
rows = cursor.execute("SELECT EmpName FROM Emp").fetchall()

# Print 'EmpName' for all records
for row in rows:
    print(row[0])

Ujjawal
Satya
Arnav
Arman
Arjun
Deepak
John
Jane
Smith
Brown
Taylor
Johnson
Williams